src/Trade/cf/Enums/СтатусыЗаказовКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказовКлиента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КСборке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетОформленияДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгрузить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Trade/cf/Enums/СтатусыЗаказовКлиента/Ext/ManagerModule.bsl
#Область Брокер

Функция ДанныеОбъектаКВыгрузке(Объект) Экспорт
	
	// Упрощено чтоб не изобредать КД или БитАдаптер
	
	ПолноеИмя = Объект.Метаданные().ПолноеИмя();
	ДанныеОбъекта = ОбменСообщениямиПодготовкаСообщенияСервер.ШаблонСообщенияДляПреобразованияОбъектаВJSON();
	ДанныеОбъекта.ПолноеИмяОбъектаМетаданных = ПолноеИмя;
	
	ИндексЗначения = Перечисления.СтатусыЗаказовКлиента.Индекс(Объект);
	Имя = Метаданные.Перечисления.СтатусыЗаказовКлиента.ЗначенияПеречисления[ИндексЗначения].Имя;	
	
	Реквизиты = Новый Структура("Имя", Имя);
	
	ДанныеОбъекта.Реквизиты = Реквизиты;
	
	Возврат ДанныеОбъекта;		
	
КонецФункции

Функция ВыгружаемыеСтатусы() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить(Перечисления.СтатусыЗаказовКлиента.КСборке);
	Результат.Добавить(Перечисления.СтатусыЗаказовКлиента.Отгрузить);
		
	Возврат Результат;	
	
КонецФункции


#КонецОбласти
